Revit 2018 API
SolidOptions Properties
The SolidOptions type exposes the following members.
Properties
Name | Description
GraphicsStyleId
 Defines the graphics style id for the Solid.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MaterialId
 Defines the material id for the Solid.
See Also
SolidOptions Class
Autodesk.Revit.DB Namespace